#include <iostream

using namespace std;

// Вывести последнюю цифру - применяю деление с остатком на 10

int main(){
	int a;
	cin >> a;
	cout << a % 10;
	return 0;
}
